AndroidCrypto/ESP32_Adafruit_PN532_Read_Credit_Card/Esp32_Adafruit_PN532_EmvLib_CreditCardReader_v13/ESP32_EMV.cpp
#include "Arduino.h"
#include "ESP32_EMV.h"
#include <Adafruit_PN532.h>


/////////////////////////////////////////////////////////////////////////////////////
//
// Basic functions for communicating with EMV cards
//
/////////////////////////////////////////////////////////////////////////////////////

ESP32_EMV::ESP32_EMV(Adafruit_PN532* nfc) {
  emvLib = nfc;
}

/////////////////////////////////////////////////////////////////////////////////////
//
// Credit Card Handling
//
/////////////////////////////////////////////////////////////////////////////////////

ESP32_EMV::EMV_StatusCode ESP32_EMV::SelectPpse(byte* backReadData, uint16_t* backReadLen) {
  //uint16_t selectPpseLen = 14;
  // byte[] PPSE = "2PAY.SYS.DDF01".getBytes(StandardCharsets.UTF_8); // PPSE
  //byte selectPpse[14] = { 0x32, 0x50, 0x41, 0x59, 0x2E, 0x53, 0x59, 0x53, 0x2E, 0x44, 0x44, 0x46, 0x30, 0x31 };
  uint16_t backLen = 255;
  byte backData[backLen];

  EMV_StatusCode statusCode;
  statusCode = SelectApdu(SELECT_PPSE_COMMAND, sizeof(SELECT_PPSE_COMMAND), 0x01, backData, &backLen);

  if (statusCode != EMV_STATUS_OK) {
    *backReadLen = backLen;
    return (EMV_StatusCode)statusCode;
  }

  memcpy(backReadData, backData, backLen);
  *backReadLen = backLen;
  return EMV_STATUS_OK;
}

// SerarchIndex: 0 = no search, 1 = search for tag 4Fh = AID, 2 = search for tag 9F38h = PDOL
ESP32_EMV::EMV_StatusCode ESP32_EMV::SelectApdu(byte* sendData, byte sendLen, byte searchIndex, byte* backReadData, uint16_t* backReadLen) {

  if (METHOD_DEBUG_PRINT) {
    Serial.printf("SelectApdu searchIndex %02x\n", searchIndex);
  }

  //byte backData[256];
  byte backData[255];
  uint16_t backLen = 255;
  byte leByte = 0xF8;  // don't ask for the full length in the first run

  EMV_StatusCode statusCode;
  statusCode = SelectApdu_Le(sendData, sendLen, leByte, backData, &backLen);

  if (statusCode != EMV_STATUS_OK) return statusCode;

  if (backLen == 2) {
    if (METHOD_DEBUG_PRINT) Serial.printf("statusCode %d backLen %d\n", statusCode, backLen);
    if (backData[backLen - 2] == 0x67 && backData[backLen - 1] == 0x00) {
      if (METHOD_DEBUG_PRINT) {
        // this means the card is asking for a 'zero' Le
        Serial.println("------------------------");
        Serial.println("Card is asking for Le = 0x00");
      }

      leByte = 0x00;
      backLen = 255;
      statusCode = SelectApdu_Le(sendData, sendLen, leByte, backData, &backLen);
    }
  }

  if (backLen == 255) {
    uint8_t retries = 0;
    bool tryNewSend = true;
    while (tryNewSend) {
      if (METHOD_DEBUG_PRINT) {
        Serial.println("------------------------");
        Serial.printf("Retry No %d\n", retries + 1);
      }
      backLen = 255;
      statusCode = SelectApdu_Le(sendData, sendLen, leByte, backData, &backLen);
      if (backLen < 255) tryNewSend = false;
      retries++;
      if (retries == NUMBER_OF_RETRIES) tryNewSend = false;
    }
  }

  // if something gone wrong the backLen seems to be 255
  if (backLen < 255) {

    if (statusCode != EMV_STATUS_OK)
      return (EMV_StatusCode)statusCode;

    // BER-TLV decoder
    uint8_t buffer[255];
    //TLVS tlvs;
    TLVNode *tlvNode, *childNode;
    size_t data_size;
    memcpy(buffer, backData, backLen);
    tlvs.decodeTLVs(buffer, sizeof(buffer));

    int tlvsErrorValue = tlvs.errorValue();
    //Serial.printf("tlvsErrorValue %d\n", tlvsErrorValue);
    /*
    int tlvNodeErrorCodes = tlvNode->errorCodes();
    Serial.printf("tlvNodeErrorCodes %d\n", tlvNodeErrorCodes);
    int tlvChildNodeErrorCodes = childNode->errorCodes();
    Serial.printf("tlvChildNodeErrorCodes %d\n", tlvChildNodeErrorCodes);
    */

    // Dump the decoded TLV structure
    tlvNode = tlvs.firstTLV();

    if (METHOD_DEBUG_PRINT) {
      Serial.print("TLV Node ");
      Serial.println(tlvNode->getTag(), HEX);
    }
    for (childNode = tlvNode->firstChild(); childNode; childNode = tlvNode->nextChild(childNode)) {
      if (METHOD_DEBUG_PRINT) {
        Serial.print("Child Node ");
        Serial.println(childNode->getTag(), HEX);
      }
    }
    TLVS::printTLV(tlvNode);

    if (searchIndex == 0x01) {
      if (METHOD_DEBUG_PRINT) Serial.printf("Search for tag 4F (AIDs on card)\n");
      numberOfAids = 0;
      // find a tag
      TLVNode* tlvNodeSearch;
      uint16_t tag4F = 0x4F;
      tlvNodeSearch = tlvs.findTLV(tag4F);

      // don't proceed if result is NULL

      if (tlvNodeSearch != NULL) {

        const uint8_t* tag4FValue = tlvNodeSearch->getValue();
        uint32_t tag4FValueLength = tlvNodeSearch->getValueLength();

        if (METHOD_DEBUG_PRINT) Serial.printf("tlvNode->getValue length %d\n", tag4FValueLength);
        //printHex((byte) tag4FValue, sizeof(tag4FValue));
        //for (uint8_t i = 0; i < sizeof(tag4FValue); i++) {
        for (uint8_t i = 0; i < tag4FValueLength; i++) {
          if (METHOD_DEBUG_PRINT) Serial.printf("%02x ", tag4FValue[i]);
          aids[numberOfAids][i] = tag4FValue[i];
        }
        aidsLen[numberOfAids] = tag4FValueLength;
        numberOfAids++;

        while (tlvNodeSearch = tlvs.findNextTLV(tlvNodeSearch)) {
          if (tlvNodeSearch == NULL) {
            if (METHOD_DEBUG_PRINT) Serial.println("tlvNodeSearch = tlvs.findNextTLV() == NULL");
          } else {
            if (METHOD_DEBUG_PRINT) Serial.println("tlvNodeSearch = tlvs.findNextTLV() NOT NULL");
            const uint8_t* tag4FValueN;
            tag4FValueN = tlvNodeSearch->getValue();
            tag4FValueLength = tlvNodeSearch->getValueLength();
            if (METHOD_DEBUG_PRINT) Serial.printf("tlvNode->getValue length %d\n", tag4FValueLength);
            for (uint8_t i = 0; i < tag4FValueLength; i++) {
              if (METHOD_DEBUG_PRINT) Serial.printf("%02x ", tag4FValueN[i]);
              aids[numberOfAids][i] = tag4FValueN[i];
            }
            aidsLen[numberOfAids] = tag4FValueLength;
            numberOfAids++;
            if (METHOD_DEBUG_PRINT) Serial.println("***");
          }
        }
        if (METHOD_DEBUG_PRINT) Serial.printf("Found %d AIDs on the card\n", numberOfAids);
      }  // if tlvNodeSearch != NULL
    } else if (searchIndex == 0x02) {
      // search for tag 9F38 = PDOL
      if (METHOD_DEBUG_PRINT) Serial.printf("Search for tag 9F38 (PDOLs)\n");
      TLVNode* tlvNodeSearch;
      uint16_t tag9F38 = 0x9F38;
      tlvNodeSearch = tlvs.findTLV(tag9F38);

      // don't proceed if result is NULL
      // Tag: 9F38 Length: 6
      //      9F 02 06 9F 1D 02

      // Tag: 9F38 Length: 9
      //      9F 35 01 9F 40 01 9F 1D 02

      // Tag: 9F38 Length: 18
      //      9F 66 04 9F 02 06 9F 03 06 9F 1A 02 95 05 5F 2A 02 9A 03 9C 01 9F 37 04


