AndroidCrypto/ESP32_Adafruit_PN532_Read_Credit_Card/Esp32_Adafruit_PN532_EmvLib_CreditCardReader_v13/ESP32_EMV.cpp
      if (tlvNodeSearch != NULL) {

        const uint8_t* tag9F3AValue = tlvNodeSearch->getValue();
        uint32_t tag9F3AValueLength = tlvNodeSearch->getValueLength();

        if (METHOD_DEBUG_PRINT) Serial.printf("tlvNode->getValue length %d\n", tag9F3AValueLength);
        //printHex((byte) tag4FValue, sizeof(tag4FValue));
        //for (uint8_t i = 0; i < sizeof(tag4FValue); i++) {
        for (uint8_t i = 0; i < tag9F3AValueLength; i++) {
          if (METHOD_DEBUG_PRINT) Serial.printf("%02x ", tag9F3AValue[i]);
          pdol[i] = tag9F3AValue[i];
        }
        pdolLen = tag9F3AValueLength;
        if (METHOD_DEBUG_PRINT) Serial.println("*PDOL*");
      } else {
        pdolLen = 255;
      }
    }

    if (backLen > 2)
      memcpy(backReadData, backData, backLen - 2);
    *backReadLen = backLen - 2;

    return EMV_STATUS_OK;
  }
  *backReadLen = backLen;
  return EMV_STATUS_ERROR;
}

// This is the native code for SelectApdu. To be flexible this method allows to use alternative Le values (usually 0x00h)
ESP32_EMV::EMV_StatusCode ESP32_EMV::SelectApdu_Le(byte* sendData, byte sendLen, byte leByte, byte* backReadData, uint16_t* backReadLen) {
  if (METHOD_DEBUG_PRINT) {
    Serial.printf("SelectApdu leByte %02x sendLen %d data:\n", leByte, sendLen);
    printHex(sendData, sendLen);
    Serial.println();
  }

  byte* sendData2 = new byte[sendLen + 6];

  sendData2[0] = 0x00;           // CLA
  sendData2[1] = 0xA4;           // INS
  sendData2[2] = 0x04;           // P1
  sendData2[3] = 0x00;           // P2
  sendData2[4] = (byte)sendLen;  // Lc
  memcpy(&sendData2[5], sendData, sendLen);
  sendData2[sendLen + 5] = leByte;  // Le (0x00h)

  byte backData[255];
  byte backLen = 255;

  EMV_StatusCode statusCode;

  statusCode = EMV_BasicTransceive(sendData2, sendLen + 6, backData, &backLen);
  memcpy(backReadData, backData, backLen);
  *backReadLen = backLen;
  return statusCode;
}

ESP32_EMV::EMV_StatusCode ESP32_EMV::SendPdol(byte* backReadData, uint16_t* backReadLen) {
  // the data is in pdol and pdolLen
  EMV_StatusCode statusCode;
  byte backData[255];
  uint16_t backLen = 255;
  byte leByte;
  if (pdolLen > 254) {
    if (METHOD_DEBUG_PRINT) Serial.println("SendPdol is empty");
    // this is the MasterCard way, no PDOL is present and a zeroed PDOL is send
    // 80 A8 00 00 02 83 00 00
    backLen = 255;
    byte pdolEmpty[2];
    pdolEmpty[0] = 0x83;
    pdolEmpty[1] = 0x00;
    leByte = 0xF8;
    //leByte = 0xDF;
    statusCode = SendPdol_Le(pdolEmpty, sizeof(pdolEmpty), leByte, backData, &backLen);

    if (backLen == 2) {
      if (METHOD_DEBUG_PRINT) Serial.printf("statusCode %d backLen %d\n", statusCode, backLen);
      if (backData[backLen - 2] == 0x67 && backData[backLen - 1] == 0x00) {
        // this means the card is asking for a 'zero' Le
        if (METHOD_DEBUG_PRINT) Serial.println("Card is asking for Le = 0x00");
        backLen = 255;
        leByte = 0x00;
        //hexCharacterStringToBytes(pdolEmpty, pdolEmptyStringLe00);
        statusCode = SendPdol_Le(pdolEmpty, sizeof(pdolEmpty), leByte, backData, &backLen);
      }
    }

    /*
SendPdol is empty
Send length 8
 80 A8 00 00 02 83 00 00
Recv length 22
 77 12 82 02 19 80 94 0C 08 01 01 00 10 01 01 01 20 01 02 00 90 00
*/
  } else {
    if (METHOD_DEBUG_PRINT) Serial.printf("SendPdol is requested with length %d\n", pdolLen);

    // get the entries
    uint8_t pde = 0;  // pdol entry position
    uint8_t sumPdeResponse = 0;
    byte sendDataTemp[250];
    sendDataTemp[0] = 0x83;
    //sendDataTemp[1] = length of following data , is filled after all data is known
    uint8_t sendDataTempIndex = 2;
    while (pde < pdolLen) {
      bool isOneBytePdolTag = CheckOneBytePdol(pdol[pde]);
      byte byte1 = pdol[pde];
      if (isOneBytePdolTag) {
        // the next byte is the length
        pde++;
        uint8_t respLen = pdol[pde];
        // get the data from the look up and paste it in the sendDataTemp array
        byte resp[respLen];
        byte respLen1;
        bool suc1 = LookUpPdolOneByte(byte1, respLen, resp, &respLen1);
        for (uint8_t i = 0; i < respLen1; i++) {
          sendDataTemp[sendDataTempIndex] = resp[i];
          sendDataTempIndex++;
        }
        sumPdeResponse += respLen;
        pde++;
      } else {
        // two tag bytes, then the length
        //byte byte1 = pdol[pde]; // already catched up
        pde++;
        byte byte2 = pdol[pde];
        pde++;
        uint8_t respLen = pdol[pde];
        // get the data from the look up and paste it in the sendDataTemp array
        byte resp[respLen];
        byte respLen1;
        bool suc2 = LookUpPdolTwoByte(byte1, byte2, respLen, resp, &respLen1);
        for (uint8_t i = 0; i < respLen1; i++) {
          sendDataTemp[sendDataTempIndex] = resp[i];
          sendDataTempIndex++;
        }
        sumPdeResponse += respLen;
        pde++;
      }
    }
    sendDataTemp[1] = sumPdeResponse;  // length of following data
    if (METHOD_DEBUG_PRINT) Serial.printf("Sum requested response bytes: %d\n", sumPdeResponse);

    backLen = 255;
    leByte = 0xF8;
    statusCode = SendPdol_Le(sendDataTemp, sumPdeResponse + 2, leByte, backData, &backLen);

    if (backLen == 2) {
      if (METHOD_DEBUG_PRINT) Serial.printf("statusCode %d backLen %d\n", statusCode, backLen);
      if (backData[backLen - 2] == 0x67 && backData[backLen - 1] == 0x00) {
        // this means the card is asking for a 'zero' Le
        if (METHOD_DEBUG_PRINT) Serial.println("Card is asking for Le = 0x00");
        backLen = 255;
        leByte = 0x00;
        statusCode = SendPdol_Le(sendDataTemp, sumPdeResponse + 2, leByte, backData, &backLen);
      }
    }
  }

  if (METHOD_DEBUG_PRINT) Serial.printf("SendPdol statusCode %02x\n", statusCode);
  if (statusCode != EMV_STATUS_OK) {
    Serial.println("SendPdol statusCode ERROR - no more decoding");
    return EMV_STATUS_ERROR;
  }

