AndroidCrypto/ESP32_Adafruit_PN532_Read_Credit_Card/Esp32_Adafruit_PN532_EmvLib_CreditCardReader_v13/ESP32_EMV.cpp
  // BER-TLV decoder
  uint8_t buffer[255];
  //TLVS tlvs;
  TLVNode *tlvNode, *childNode;
  size_t data_size;
  memcpy(buffer, backData, backLen);
  tlvs.decodeTLVs(buffer, sizeof(buffer));

  int tlvsErrorValue = tlvs.errorValue();
  //Serial.printf("tlvsErrorValue %d\n", tlvsErrorValue);
  /*
    int tlvNodeErrorCodes = tlvNode->errorCodes();
    Serial.printf("tlvNodeErrorCodes %d\n", tlvNodeErrorCodes);
    int tlvChildNodeErrorCodes = childNode->errorCodes();
    Serial.printf("tlvChildNodeErrorCodes %d\n", tlvChildNodeErrorCodes);
    */

  // Dump the decoded TLV structure
  tlvNode = tlvs.firstTLV();
  if (METHOD_DEBUG_PRINT) {
    Serial.print("TLV Node ");
    Serial.println(tlvNode->getTag(), HEX);
  }
  for (childNode = tlvNode->firstChild(); childNode; childNode = tlvNode->nextChild(childNode)) {
    if (METHOD_DEBUG_PRINT) {
      Serial.print("Child Node ");
      Serial.println(childNode->getTag(), HEX);
    }
  }
  TLVS::printTLV(tlvNode);

  // search for tag 57 Track 2 Equivalent Data
  if (METHOD_DEBUG_PRINT) Serial.printf("Search for tag 57 (Track 2 Equivalent Data)\n");
  // find a tag
  // TLVNode* findTLV(uint16_t tag);
  // TLVNode* findNextTLV(TLVNode* node);
  tag57CompleteLen = 255;
  TLVNode* tlvNodeSearch;
  uint16_t tag57 = 0x57;
  tlvNodeSearch = tlvs.findTLV(tag57);

  // don't proceed if result is NULL

  if (tlvNodeSearch != NULL) {

    const uint8_t* tag57Value = tlvNodeSearch->getValue();
    uint32_t tag57ValueLength = tlvNodeSearch->getValueLength();

    if (METHOD_DEBUG_PRINT) Serial.printf("tlvNode->getValue length %d\n", tag57ValueLength);
    //printHex((byte) tag4FValue, sizeof(tag4FValue));
    //for (uint8_t i = 0; i < sizeof(tag4FValue); i++) {
    for (uint8_t i = 0; i < tag57ValueLength; i++) {
      if (METHOD_DEBUG_PRINT) Serial.printf("%02x ", tag57Value[i]);
      tag57Complete[i] = tag57Value[i];
    }
    tag57CompleteLen = tag57ValueLength;

    // get the pan and exp date
    t57PanLen = 0;
    t57ExpDateLen = 0;
    bool isPanDelimiterFound = false;
    byte posByte;
    uint8_t posIndex = 0;
    //char panChar[30];
    memset(panChar, 0, 20);
    //uint8_t panCharLen = 0;
    char bChar[2];
    //char expDateChar[10];
    //uint8_t expDateCharLen = 0;
    while (!isPanDelimiterFound) {
      posByte = tag57Complete[posIndex];
      byte upperByte = (tag57Complete[posIndex] & 0xF0) >> 4;
      byte lowerByte = (tag57Complete[posIndex] & 0x0F);
      if (METHOD_DEBUG_PRINT) Serial.printf("posIndex %d byte %02x upperByte %02x lowerByte %02x\n", posIndex, tag57Complete[posIndex], upperByte, lowerByte);
      if (upperByte != 0xd) {
        sprintf(bChar, "%x", upperByte);
        if (posIndex == 0) {
          strcpy(panChar, bChar);
        } else {
          strcat(panChar, bChar);
        }
        panCharLen++;
        if (lowerByte != 0xd) {
          sprintf(bChar, "%x", lowerByte);
          strcat(panChar, bChar);
          panCharLen++;
        }
      }
      if ((upperByte == 0xd) || (lowerByte == 0xd)) {
        if (upperByte == 0xd) {
          // the lower byte contains the first expiring year
          sprintf(bChar, "%x", lowerByte);
          strcpy(expDateChar, bChar);
          expDateCharLen++;
        }
        isPanDelimiterFound = true;
      }
      posIndex++;
    }

    // now we copy 1..4 expiring date characters
    while (expDateCharLen < 4) {
      posByte = tag57Complete[posIndex];
      byte upperByte = (tag57Complete[posIndex] & 0xF0) >> 4;
      byte lowerByte = (tag57Complete[posIndex] & 0x0F);
      if (METHOD_DEBUG_PRINT) Serial.printf("posIndex %d byte %02x upperByte %02x lowerByte %02x\n", posIndex, tag57Complete[posIndex], upperByte, lowerByte);
      sprintf(bChar, "%x", upperByte);
      if (expDateCharLen == 0) {
        strcpy(expDateChar, bChar);
      } else {
        strcat(expDateChar, bChar);
      }
      expDateCharLen++;
      if (expDateCharLen < 4) {
        sprintf(bChar, "%x", lowerByte);
        strcat(expDateChar, bChar);
        expDateCharLen++;
      }
      posIndex++;
    }
    if (METHOD_DEBUG_PRINT) {
      Serial.printf("Pan length %d: %s\n", panCharLen, panChar);
      Serial.printf("ExpDate length %d: %s\n", expDateCharLen, expDateChar);
    }
  } else {
    if (METHOD_DEBUG_PRINT) Serial.println("No tag57 found");
  }

  // search for tag 94h = AFL = Application File Locator
  if (METHOD_DEBUG_PRINT) Serial.printf("Search for tag 94 (AFL Application File Locator)\n");
  bool tag94Found = false;
  t94AflLen = 0;
  uint16_t tag94 = 0x94;
  tlvNodeSearch = tlvs.findTLV(tag94);
  if (tlvNodeSearch != NULL) {
    tag94Found = true;
    const uint8_t* tag94Value = tlvNodeSearch->getValue();
    uint32_t tag94ValueLength = tlvNodeSearch->getValueLength();

    if (METHOD_DEBUG_PRINT) Serial.printf("tlvNode->getValue length %d\n", tag94ValueLength);
    //printHex((byte) tag4FValue, sizeof(tag4FValue));
    //for (uint8_t i = 0; i < sizeof(tag4FValue); i++) {
    for (uint8_t i = 0; i < tag94ValueLength; i++) {
      if (METHOD_DEBUG_PRINT) Serial.printf("%02x ", tag94Value[i]);
      t94Afl[i] = tag94Value[i];
    }
    if (METHOD_DEBUG_PRINT) Serial.println();
    t94AflLen = tag94ValueLength;
  } else {
    if (METHOD_DEBUG_PRINT) Serial.println("No tag94 (AFL) found");
  }

  // now search for 'Response Message Template Format 1' that is in use e.g. for American Express Cards
  // search for tag 80h = Response Message Template Format 1
  if (!tag94Found) {
    if (METHOD_DEBUG_PRINT) Serial.printf("Search for tag 80h (Response Message Template Format 1)\n");
    uint8_t t80Len = 0;
    uint16_t tag80 = 0x80;
    byte t80[250];
    tlvNodeSearch = tlvs.findTLV(tag80);
    if (tlvNodeSearch != NULL) {
      if (METHOD_DEBUG_PRINT) Serial.println("Found Tag 80");
      const uint8_t* tag80Value = tlvNodeSearch->getValue();
      uint32_t tag80ValueLength = tlvNodeSearch->getValueLength();

      if (METHOD_DEBUG_PRINT) Serial.printf("tlvNode->getValue length %d\n", tag80ValueLength);
      //printHex((byte) tag4FValue, sizeof(tag4FValue));
      //for (uint8_t i = 0; i < sizeof(tag4FValue); i++) {
      for (uint8_t i = 0; i < tag80ValueLength; i++) {
        if (METHOD_DEBUG_PRINT) Serial.printf("%02x ", tag80Value[i]);
        t80[i] = tag80Value[i];
      }
      if (METHOD_DEBUG_PRINT) Serial.println();
      t80Len = tag80ValueLength;

