AndroidCrypto/ESP32_Adafruit_PN532_Read_Credit_Card/Esp32_Adafruit_PN532_EmvLib_CreditCardReader_v13/ESP32_EMV.cpp
      // I'm reusing the wrong variable
      for (uint8_t i = 0; i < t80Len - 2; i++) {
        t94Afl[i] = t80[i + 2];
      }
      t94AflLen = t80Len - 2;
    } else {
      if (METHOD_DEBUG_PRINT) Serial.println("No tag80 (Response Message Template Format 1) found");
    }
  }

  return EMV_STATUS_OK;
}

// This is the native code for SendPdol that allows for a flexible Le byte
ESP32_EMV::EMV_StatusCode ESP32_EMV::SendPdol_Le(byte* sendData, byte sendLen, byte leByte, byte* backReadData, uint16_t* backReadLen) {
  if (METHOD_DEBUG_PRINT) {
    Serial.printf("SendPdol leByte %02x sendLen %d data:\n", leByte, sendLen);
    printHex(sendData, sendLen);
    Serial.println();
  }

  byte sendData2[sendLen + 6];
  sendData2[0] = 0x80;           // CLA
  sendData2[1] = 0xA8;           // INS
  sendData2[2] = 0x00;           // P1
  sendData2[3] = 0x00;           // P2
  sendData2[4] = (byte)sendLen;  // Lc
  memcpy(&sendData2[5], sendData, sendLen);
  sendData2[sendLen + 5] = leByte;  // Le

  byte backData[255];
  byte backLen = 255;

  EMV_StatusCode statusCode;

  statusCode = EMV_BasicTransceive(sendData2, sendLen + 6, backData, &backLen);
  memcpy(backReadData, backData, backLen);
  *backReadLen = backLen;
  return statusCode;
}

bool ESP32_EMV::LookUpPdolOneByte(byte byte1, byte length, byte* resData, byte* resLength) {
  if (byte1 == 0x95) {
    uint8_t rLen = 5;
    byte temp[rLen];
    memset(temp, 0, rLen);
    memcpy(resData, temp, rLen);
    *resLength = rLen;
    if (PDOL_DEBUG_PRINT) {
      Serial.printf("LookUp 1 Byte byte1 %02x byte2 -- length %2d respLen %d resData", byte1, length, rLen);
      printHex(resData, rLen);
      Serial.println();
    }
    return true;
  } else if (byte1 == 0x9a) {
    uint8_t rLen = 3;
    byte temp[rLen];
    //temp[0] = 0x23;
    temp[0] = 0x25;
    temp[1] = 0x03;
    temp[2] = 0x01;
    memcpy(resData, temp, rLen);
    *resLength = rLen;
    if (PDOL_DEBUG_PRINT) {
      Serial.printf("LookUp 1 Byte byte1 %02x byte2 -- length %2d respLen %d resData", byte1, length, rLen);
      printHex(resData, rLen);
      Serial.println();
    }
    return true;
  } else if (byte1 == 0x9c) {
    uint8_t rLen = 1;
    byte temp[rLen];
    temp[0] = 0x00;
    memcpy(resData, temp, rLen);
    *resLength = rLen;
    if (PDOL_DEBUG_PRINT) {
      Serial.printf("LookUp 1 Byte byte1 %02x byte2 -- length %2d respLen %d resData", byte1, length, rLen);
      printHex(resData, rLen);
      Serial.println();
    }
    return true;
  } else {
    byte temp[length];
    memset(temp, 0, length);
    memcpy(resData, temp, length);
    *resLength = length;
    if (PDOL_DEBUG_PRINT) {
      Serial.printf("LookUp 1 Byte byte1 %02x byte2 -- length %2d respLen %d resData", byte1, length, length);
      printHex(resData, length);
      Serial.println();
    }
    return false;
  }
}

bool ESP32_EMV::LookUpPdolTwoByte(byte byte1, byte byte2, byte length, byte* resData, byte* resLength) {
  if ((byte1 == 0x9f) && (byte2 == 0x66)) {
    uint8_t rLen = 4;
    byte temp[rLen];
    memset(temp, 0, rLen);
    temp[0] = 0x27;
    memcpy(resData, temp, rLen);
    *resLength = rLen;
    if (PDOL_DEBUG_PRINT) {
      Serial.printf("LookUp 2 Byte byte1 %02x byte2 %02x length %2d respLen %d resData", byte1, byte2, length, rLen);
      printHex(resData, rLen);
      Serial.println();
    }
    return true;
  } else if ((byte1 == 0x9f) && (byte2 == 0x02)) {
    uint8_t rLen = 6;
    byte temp[rLen];
    memset(temp, 0, rLen);
    temp[4] = 0x10;
    memcpy(resData, temp, rLen);
    *resLength = rLen;
    if (PDOL_DEBUG_PRINT) {
      Serial.printf("LookUp 2 Byte byte1 %02x byte2 %02x length %2d respLen %d resData", byte1, byte2, length, rLen);
      printHex(resData, rLen);
      Serial.println();
    }
    return true;
  } else if ((byte1 == 0x9f) && (byte2 == 0x03)) {
    uint8_t rLen = 6;
    byte temp[rLen];
    memset(temp, 0, rLen);
    memcpy(resData, temp, rLen);
    *resLength = rLen;
    if (PDOL_DEBUG_PRINT) {
      Serial.printf("LookUp 2 Byte byte1 %02x byte2 %02x length %2d respLen %d resData", byte1, byte2, length, rLen);
      printHex(resData, rLen);
      Serial.println();
    }
    return true;
  } else if ((byte1 == 0x9f) && (byte2 == 0x1a)) {
    uint8_t rLen = 2;
    byte temp[rLen];
    temp[0] = 0x09;
    temp[1] = 0x78;
    memcpy(resData, temp, rLen);
    *resLength = rLen;
    if (PDOL_DEBUG_PRINT) {
      Serial.printf("LookUp 2 Byte byte1 %02x byte2 %02x length %2d respLen %d resData", byte1, byte2, length, rLen);
      printHex(resData, length);
      Serial.println();
    }
    return true;
  } else if ((byte1 == 0x5f) && (byte2 == 0x2a)) {
    uint8_t rLen = 2;
    byte temp[rLen];
    temp[0] = 0x09;
    temp[1] = 0x78;
    memcpy(resData, temp, rLen);
    *resLength = rLen;
    if (PDOL_DEBUG_PRINT) {
      Serial.printf("LookUp 2 Byte byte1 %02x byte2 %02x length %2d respLen %d resData", byte1, byte2, length, rLen);
      printHex(resData, rLen);
      Serial.println();
    }
    return true;
  } else if ((byte1 == 0x9f) && (byte2 == 0x37)) {
    uint8_t rLen = 4;
    byte temp[rLen];
    temp[0] = 0x38;
    temp[1] = 0x39;
    temp[2] = 0x30;
    temp[3] = 0x31;
    memcpy(resData, temp, rLen);
    *resLength = rLen;
    if (PDOL_DEBUG_PRINT) {
      Serial.printf("LookUp 2 Byte byte1 %02x byte2 %02x length %2d respLen %d resData", byte1, byte2, length, rLen);
      printHex(resData, rLen);
      Serial.println();
    }
    return true;
  } else if ((byte1 == 0x9f) && (byte2 == 0x35)) {
    uint8_t rLen = 1;
    byte temp[rLen];
    temp[0] = 0x22;
    memcpy(resData, temp, rLen);
    *resLength = rLen;
    if (PDOL_DEBUG_PRINT) {
      Serial.printf("LookUp 2 Byte byte1 %02x byte2 %02x length %2d respLen %d resData", byte1, byte2, length, rLen);
      printHex(resData, rLen);
      Serial.println();
    }
    return true;
  } else if ((byte1 == 0x9f) && (byte2 == 0x45)) {
    uint8_t rLen = 2;
    byte temp[rLen];
    temp[0] = 0x00;
    temp[1] = 0x00;
    memcpy(resData, temp, rLen);
    *resLength = rLen;
    if (PDOL_DEBUG_PRINT) {
      Serial.printf("LookUp 2 Byte byte1 %02x byte2 %02x length %2d respLen %d resData", byte1, byte2, length, rLen);
      printHex(resData, rLen);
      Serial.println();
    }
    return true;
  } else if ((byte1 == 0x9f) && (byte2 == 0x4c)) {
    uint8_t rLen = 8;
    byte temp[rLen];
    memset(temp, 0, rLen);
    memcpy(resData, temp, rLen);
    *resLength = rLen;
    if (PDOL_DEBUG_PRINT) {
      Serial.printf("LookUp 2 Byte byte1 %02x byte2 %02x length %2d respLen %d resData", byte1, byte2, length, rLen);
      printHex(resData, rLen);
      Serial.println();
    }
    return true;
  } else if ((byte1 == 0x9f) && (byte2 == 0x34)) {
    uint8_t rLen = 3;
    byte temp[rLen];
    memset(temp, 0, rLen);
    memcpy(resData, temp, rLen);
    *resLength = rLen;
    if (PDOL_DEBUG_PRINT) {
      Serial.printf("LookUp 2 Byte byte1 %02x byte2 %02x length %2d respLen %d resData", byte1, byte2, length, rLen);
      printHex(resData, rLen);
      Serial.println();
    }
    return true;
  } else if ((byte1 == 0x9f) && (byte2 == 0x21)) {
    uint8_t rLen = 3;
    byte temp[rLen];
    temp[0] = 0x11;
    temp[1] = 0x10;
    temp[2] = 0x09;
    memcpy(resData, temp, rLen);
    *resLength = rLen;
    if (PDOL_DEBUG_PRINT) {
      Serial.printf("LookUp 2 Byte byte1 %02x byte2 %02x length %2d respLen %d resData", byte1, byte2, length, rLen);
      printHex(resData, rLen);
      Serial.println();
    }
    return true;
  } else if ((byte1 == 0x9f) && (byte2 == 0x7c)) {
    uint8_t rLen = 14;
    byte temp[rLen];
    memset(temp, 0, rLen);
    memcpy(resData, temp, rLen);
    *resLength = rLen;
    if (PDOL_DEBUG_PRINT) {
      Serial.printf("LookUp 2 Byte byte1 %02x byte2 %02x length %2d respLen %d resData", byte1, byte2, length, rLen);
      printHex(resData, rLen);
      Serial.println();
    }
    return true;
  } else {
    byte temp[length];
    memset(temp, 0, length);
    memcpy(resData, temp, length);
    *resLength = length;
    if (PDOL_DEBUG_PRINT) Serial.printf("LookUp 2 Byte byte1 %02x byte2 -- length %2d respLen %d resData", byte1, length, length);
    return false;
  }
}

// returns true if data byte is in the list of one byte commands
bool ESP32_EMV::CheckOneBytePdol(byte data) {
  // checks a list against the byte https://paymentcardtools.com/emv-misc/dols
  if (data == 0x95) {
    return true;
  } else if (data == 0x9a) {
    return true;
  } else if (data == 0x9c) {
    return true;
  }
  return false;
}

ESP32_EMV::EMV_StatusCode ESP32_EMV::ReadRecord(byte* aflEntry, byte* appData, uint16_t* backReadLen) {
  if (METHOD_DEBUG_PRINT) {
    Serial.print("ReadRecord");
    printHex(aflEntry, 4);
    Serial.println();
  }

