AndroidCrypto/ESP32_Adafruit_PN532_Read_Credit_Card/Esp32_Adafruit_PN532_EmvLib_CreditCardReader_v13/ESP32_EMV.cpp
  // https://werner.rothschopf.net/201703_arduino_esp8266_nfc.htm
  uint8_t SFI = aflEntry[0] >> 3;
  uint8_t P2 = SFI << 3 | 0b00000100;
/*
  byte sendData[5];
  sendData[0] = 0x00;           // Class
  sendData[1] = 0xB2;           // CMD
  sendData[2] = aflChunked[1];  // P1
  sendData[3] = P2;             // P2
  //sendData[4] = 0x00;          // Le
  sendData[4] = 0xF8;  // Le // works fine for MC Openbank first 3 files
*/
  byte backData[255];
  byte backLen = 255;
  byte leByte = 0xF8;
  EMV_StatusCode statusCode;

  //statusCode = EMV_BasicTransceive(sendData, sizeof(sendData), backData, &backLen);
  statusCode = ReadRecord_Le(aflEntry, leByte, backData, &backLen);

  if (backLen == 2) {
    if (METHOD_DEBUG_PRINT) Serial.printf("statusCode %d backLen %d\n", statusCode, backLen);
    if (backData[backLen - 2] == 0x67 && backData[backLen - 1] == 0x00) {
      // this means the card is asking for a 'zero' Le
      Serial.println("Card is asking for Le = 0x00");
      backLen = 255;
      leByte = 0x00;
      statusCode = ReadRecord_Le(aflEntry, leByte, backData, &backLen);
    }
  }

  if (METHOD_DEBUG_PRINT) Serial.printf("*** ReadRecord backLen %d\n", backLen);
  if (backLen == 0) {
    if (METHOD_DEBUG_PRINT) Serial.println("Received no valid response, aborting");
    *backReadLen = 255;
    memcpy(appData, backData, backLen);
    return EMV_STATUS_NO_RESPONSE;
  }

  // BER-TLV decoder
  uint8_t buffer[255];
  //TLVS tlvs;
  TLVNode *tlvNode, *childNode;
  size_t data_size;
  memcpy(buffer, backData, backLen);
  tlvs.decodeTLVs(buffer, sizeof(buffer));

  int tlvsErrorValue = tlvs.errorValue();
  //Serial.printf("tlvsErrorValue %d\n", tlvsErrorValue);
  /*
    int tlvNodeErrorCodes = tlvNode->errorCodes();
    Serial.printf("tlvNodeErrorCodes %d\n", tlvNodeErrorCodes);
    int tlvChildNodeErrorCodes = childNode->errorCodes();
    Serial.printf("tlvChildNodeErrorCodes %d\n", tlvChildNodeErrorCodes);
    */

  // Dump the decoded TLV structure
  tlvNode = tlvs.firstTLV();
  if (METHOD_DEBUG_PRINT) {
    Serial.print("TLV Node ");
    Serial.println(tlvNode->getTag(), HEX);
  }
  for (childNode = tlvNode->firstChild(); childNode; childNode = tlvNode->nextChild(childNode)) {
    if (METHOD_DEBUG_PRINT) {
      Serial.print("Child Node ");
      Serial.println(childNode->getTag(), HEX);
    }
  }
  TLVS::printTLV(tlvNode);

  // find Tag5A (PAN) and Tag5F24 (Exp.Date)
  /*
  byte t5aPan[20];
  byte t5aPanLen = 0;
  byte t5f24ExpDate[10];
  byte t5f24ExpDateLen = 0; // 0 = not found
*/

  // search for tag 57 Track 2 Equivalent Data
  // find a tag
  // TLVNode* findTLV(uint16_t tag);
  // TLVNode* findNextTLV(TLVNode* node);
  t5aPanLen = 0;
  t5f24ExpDateLen = 0;

  TLVNode* tlvNodeSearch;
  uint16_t tag5a = 0x5A;
  tlvNodeSearch = tlvs.findTLV(tag5a);

  // don't proceed if result is NULL

  if (tlvNodeSearch != NULL) {

    const uint8_t* tag5aValue = tlvNodeSearch->getValue();
    uint32_t tag5aValueLength = tlvNodeSearch->getValueLength();

    if (METHOD_DEBUG_PRINT) Serial.printf("tlvNode->getValue length %d\n", tag5aValueLength);
    //printHex((byte) tag4FValue, sizeof(tag4FValue));
    for (uint8_t i = 0; i < tag5aValueLength; i++) {
      if (METHOD_DEBUG_PRINT) Serial.printf("%02x ", tag5aValue[i]);
      t5aPan[i] = tag5aValue[i];
    }
    t5aPanLen = tag5aValueLength;
    if (METHOD_DEBUG_PRINT) Serial.printf("PAN found length %d\n", t5aPanLen);
    printHex(t5aPan, t5aPanLen);
    Serial.println();
  }

  // search for tag5f24 exp. date
  uint16_t tag5f24 = 0x5f24;
  tlvNodeSearch = tlvs.findTLV(tag5f24);

  // don't proceed if result is NULL

  if (tlvNodeSearch != NULL) {

    const uint8_t* tag5f24Value = tlvNodeSearch->getValue();
    uint32_t tag5f24ValueLength = tlvNodeSearch->getValueLength();

    if (METHOD_DEBUG_PRINT) Serial.printf("tlvNode->getValue length %d\n", tag5f24ValueLength);
    for (uint8_t i = 0; i < tag5f24ValueLength; i++) {
      if (METHOD_DEBUG_PRINT) Serial.printf("%02x ", tag5f24Value[i]);
      t5f24ExpDate[i] = tag5f24Value[i];
    }
    t5f24ExpDateLen = tag5f24ValueLength;
    if (METHOD_DEBUG_PRINT) {
      Serial.printf("Expire Date found length %d\n", t5f24ExpDateLen);
      printHex(t5f24ExpDate, t5f24ExpDateLen);
      Serial.println();
    }
  }

  *backReadLen = backLen;
  memcpy(appData, backData, backLen);
  return EMV_STATUS_OK;
}

ESP32_EMV::EMV_StatusCode ESP32_EMV::ReadRecord_Le(byte* aflEntry, byte leByte, byte* backReadData, byte* backReadLen) {
  if (METHOD_DEBUG_PRINT) {
    Serial.print("ReadRecord_Le");
    printHex(aflEntry, 4);
    Serial.println();
  }

  // https://werner.rothschopf.net/201703_arduino_esp8266_nfc.htm
  uint8_t SFI = aflEntry[0] >> 3;
  uint8_t P2 = SFI << 3 | 0b00000100;

  byte sendData[5];
  sendData[0] = 0x00;        // Class
  sendData[1] = 0xB2;        // CMD
  sendData[2] = aflEntry[1]; // P1
  sendData[3] = P2;          // P2
  sendData[4] = leByte;      // Le
  byte backData[255];
  byte backLen = 255;
  EMV_StatusCode statusCode;

  statusCode = EMV_BasicTransceive(sendData, sizeof(sendData), backData, &backLen);
  memcpy(backReadData, backData, backLen);
  *backReadLen = backLen;
  return statusCode;
}

// This is a very simplyfied table with my most used Credit Card issuers. It returns true if
// an AID was found or false if it is an unknown AID
// see https://www.eftlab.com/knowledge-base/complete-list-of-application-identifiers-aid
// for a complete list of AIDs
ESP32_EMV::EMV_StatusCode ESP32_EMV::LookUpAid(byte* sendData, byte sendLen, uint8_t* aidNameIndex) {
  // A0 00 00 00 03 (10) Visa
  // A0 00 00 00 04 (10) MasterCard
  // A0 00 00 00 25 (10) American Express
  // A0 00 00 00 59 (10) German girocard
  if (sendLen < 5) return EMV_STATUS_ERROR;
  if (sendData[0] != 0xA0) return EMV_STATUS_ERROR;
  if (sendData[1] != 0x00) return EMV_STATUS_ERROR;
  if (sendData[2] != 0x00) return EMV_STATUS_ERROR;
  if (sendData[3] != 0x00) return EMV_STATUS_ERROR;
  if (sendData[4] == 0x03) {
    *aidNameIndex = 1;
    Serial.println("VisaC");
    return EMV_STATUS_OK;
  } else if (sendData[4] == 0x04) {
    *aidNameIndex = 2;
    Serial.println("MasterC");
    return EMV_STATUS_OK;
  } else if (sendData[4] == 0x25) {
    *aidNameIndex = 3;
    Serial.println("AmexCo");
    return EMV_STATUS_OK;
  } else if (sendData[4] == 0x59) {
    *aidNameIndex = 4;
    Serial.println("giroC");
    return EMV_STATUS_OK;
  } else {
    *aidNameIndex = 0;
    Serial.println("UNKNOWN");
    return EMV_STATUS_ERROR;
  }
}

