AndroidCrypto/ESP32_Adafruit_PN532_Read_Credit_Card/Esp32_Adafruit_PN532_EmvLib_CreditCardReader_v13/ESP32_EMV.cpp
// PROTECTED

/*
Hexstring to byte array helper
https://forum.arduino.cc/t/hex-string-to-byte-array/563827/3
usage:
byte byteArray[MaxByteArraySize] = {0};
hexCharacterStringToBytes(byteArray, "A489B1");
dumpByteArray(byteArray, MaxByteArraySize);

*/
void ESP32_EMV::hexCharacterStringToBytes(byte* byteArray, const char* hexString) {
  bool oddLength = strlen(hexString) & 1;

  byte currentByte = 0;
  byte byteIndex = 0;

  for (byte charIndex = 0; charIndex < strlen(hexString); charIndex++) {
    bool oddCharIndex = charIndex & 1;

    if (oddLength) {
      // If the length is odd
      if (oddCharIndex) {
        // odd characters go in high nibble
        currentByte = nibble(hexString[charIndex]) << 4;
      } else {
        // Even characters go into low nibble
        currentByte |= nibble(hexString[charIndex]);
        byteArray[byteIndex++] = currentByte;
        currentByte = 0;
      }
    } else {
      // If the length is even
      if (!oddCharIndex) {
        // Odd characters go into the high nibble
        currentByte = nibble(hexString[charIndex]) << 4;
      } else {
        // Odd characters go into low nibble
        currentByte |= nibble(hexString[charIndex]);
        byteArray[byteIndex++] = currentByte;
        currentByte = 0;
      }
    }
  }
}

byte ESP32_EMV::nibble(char c) {
  if (c >= '0' && c <= '9')
    return c - '0';

  if (c >= 'a' && c <= 'f')
    return c - 'a' + 10;

  if (c >= 'A' && c <= 'F')
    return c - 'A' + 10;

  return 0;  // Not a valid hexadecimal character
}

void ESP32_EMV::dumpByteArray(const byte* byteArray, const byte arraySize) {
  for (int i = 0; i < arraySize; i++) {
    Serial.print("0x");
    if (byteArray[i] < 0x10)
      Serial.print("0");
    Serial.print(byteArray[i], HEX);
    Serial.print(", ");
  }
  Serial.println();
}

void ESP32_EMV::convertLargeInt2Uint8_t4Lsb(int& input, uint8_t* output) {
  int max2Byte = 65536;
  int highInt = input / max2Byte;
  int lowInt = input % max2Byte;
  uint8_t highUint8[2];
  convertInt2Uint8_t(highInt, highUint8);
  uint8_t lowUint8[2];
  convertInt2Uint8_t(lowInt, lowUint8);
  uint8_t convertedInt[4];
  convertedInt[3] = highUint8[0];
  convertedInt[2] = highUint8[1];
  convertedInt[1] = lowUint8[0];
  convertedInt[0] = lowUint8[1];
  int i;
  for (i = 0; i < 4; i++) {
    output[i] = convertedInt[i];
  }
}

// maximum int is 65535
void ESP32_EMV::convertInt2Uint8_t(int& input, uint8_t* output) {
  byte high = highByte(input);
  byte low = lowByte(input);
  //uint8_t uint8_22[2];
  output[0] = high;
  output[1] = low;
}

int ESP32_EMV::convertUint8_t3_2IntLsb(byte* input) {
  int outputValue = 0;
  outputValue += input[0];
  outputValue += (input[1] * 256);
  outputValue += (input[2] * 65536);
  //output = outputValue;
  return outputValue;
}

int ESP32_EMV::convertUint8_t4_2IntLsb(byte* input) {
  int outputValue = 0;
  outputValue += input[0];
  outputValue += (input[1] * 256);
  outputValue += (input[2] * 65536);
  outputValue += (input[3] * 16777216);
  return outputValue;
}

void ESP32_EMV::convertIntTo3BytesLsb(int input, byte* output) {
  byte* out = new byte[3];
  if (input > 16777215) {
    memset(output, 0, 3);
    //memcpy(output, out, 3);
    return;
  }
  out[0] = input & 0xff;
  out[1] = (input >> 8) & 0xff;
  out[2] = (input >> 16) & 0xff;
  memcpy(output, out, 3);
}

byte ESP32_EMV::upperPartByte(byte data) {
  return 0;
}

byte ESP32_EMV::lowerPartByte(byte data) {
  return 0;
}

/////////////////////////////////////////////////////////////////////////////////////
//
// Protected functions
//
/////////////////////////////////////////////////////////////////////////////////////

ESP32_EMV::EMV_StatusCode ESP32_EMV::EMV_BasicTransceive(byte* sendData, byte sendLen, byte* backData, byte* backLen) {
  ESP32_EMV::EMV_StatusCode result;
  bool success;
  EMV_StatusCode statusCode;
  byte bLen = 255;
  if (COMM_DEBUG_PRINT) {
    Serial.printf("Send length %d\n", sendLen);
    printHex(sendData, sendLen);
    Serial.println("");
  }
  success = emvLib->inDataExchange(sendData, sendLen, backData, &bLen);
  if (COMM_DEBUG_PRINT) {
    Serial.printf("Recv length %d\n", bLen);
    printHex(backData, bLen);
    Serial.println("");
  }
  if (success) {
    if (bLen == 255) {
      *backLen = bLen;
      return EMV_STATUS_NO_RESPONSE;
    } else {
      *backLen = bLen;
      return EMV_STATUS_OK;
    }
  } else {
    *backLen = 0;
    return EMV_STATUS_ERROR;
  }
}

/////////////////////////////////////////////////////////////////////////////////////
//
// Internal management
//
/////////////////////////////////////////////////////////////////////////////////////

void ESP32_EMV::printHex(byte* buffer, uint16_t bufferSize) {
  for (uint16_t i = 0; i < bufferSize; i++) {
    Serial.print(buffer[i] < 0x10 ? " 0" : " ");
    Serial.print(buffer[i], HEX);
  }
}
